tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1829lin_tdd.h
#define SSP2CON2_SEN                  522
#define SSP2CON2_RSEN                 523
#define SSP2CON2_PEN                  524
#define SSP2CON2_RCEN                 525
#define SSP2CON2_ACKEN                526
#define SSP2CON2_ACKDT                527
#define SSP2CON2_ACKSTAT              528
#define SSP2CON2_GCEN                 529
#define SSP2CON3                      530
#define SSP2CON3_DHEN                 531
#define SSP2CON3_AHEN                 532
#define SSP2CON3_SBCDE                533
#define SSP2CON3_SDAHT                534
#define SSP2CON3_BOEN                 535
#define SSP2CON3_SCIE                 536
#define SSP2CON3_PCIE                 537
#define SSP2CON3_ACKTIM               538
#define CCPR1L                        539
#define CCPR1H                        540
#define CCP1CON                       541
#define CCP1M0                        542
#define CCP1M                         543
#define CCP1M1                        544
#define CCP1M2                        545
#define CCP1M3                        546
#define DC1B                          547
#define DC1B0                         548
#define DC1B1                         549
#define P1M                           550
#define P1M0                          551
#define P1M1                          552
#define PWM1CON                       553
#define P1DC                          554
#define P1DC0                         555
#define P1DC1                         556
#define P1DC2                         557
#define P1DC3                         558
#define P1DC4                         559
#define P1DC5                         560
#define P1DC6                         561
#define P1RSEN                        562
#define PSS1BD                        563
#define PSS1BD0                       564
#define PSS1BD1                       565
#define PSS1AC                        566
#define PSS1AC0                       567
#define PSS1AC1                       568
#define CCP1AS                        569
#define CCP1AS0                       570
#define CCP1AS1                       571
#define CCP1AS2                       572
#define CCP1ASE                       573
#define PSTR1CON                      574
#define STR1A                         575
#define STR1B                         576
#define STR1C                         577
#define STR1D                         578
#define STR1SYNC                      579
#define CCPR2L                        580
#define CCPR2H                        581
#define CCP2CON                       582
#define CCP2M                         583
#define CCP2M0                        584
#define CCP2M1                        585
#define CCP2M2                        586
#define CCP2M3                        587
#define DC2B                          588
#define DC2B0                         589
#define DC2B1                         590
#define P2M                           591
#define P2M0                          592
#define P2M1                          593
#define PWM2CON                       594
#define P2DC                          595
#define P2DC0                         596
#define P2DC1                         597
#define P2DC2                         598
#define P2DC3                         599
#define P2DC4                         600
#define P2DC5                         601
#define P2DC6                         602
#define P2RSEN                        603
#define PSS2BD                        604
#define PSS2BD0                       605
#define PSS2BD1                       606
#define PSS2AC0                       607
#define PSS2AC                        608
#define PSS2AC1                       609
#define CCP2AS0                       610
#define CCP2AS                        611
#define CCP2AS1                       612
#define CCP2AS2                       613
#define CCP2ASE                       614
#define PSTR2CON                      615
#define STR2A                         616
#define STR2B                         617
#define STR2C                         618
#define STR2D                         619
#define STR2SYNC                      620
#define CCPTMRS                       621
#define C1TSEL0                       622
#define C1TSEL                        623
#define C1TSEL1                       624
#define C2TSEL0                       625
#define C2TSEL                        626
#define C2TSEL1                       627
#define C3TSEL0                       628
#define C3TSEL                        629
#define C3TSEL1                       630
#define C4TSEL                        631
#define C4TSEL0                       632
#define C4TSEL1                       633
#define CCPR3L                        634
#define CCPR3H                        635
#define CCP3CON                       636
#define CCP3M                         637
#define CCP3M0                        638
#define CCP3M1                        639
#define CCP3M2                        640
#define CCP3M3                        641
#define DC3B                          642
#define DC3B0                         643
#define DC3B1                         644
#define CCPR4L                        645
#define CCPR4H                        646
#define CCP4CON                       647
#define CCP4M                         648
#define CCP4M0                        649
#define CCP4M1                        650
#define CCP4M2                        651
#define CCP4M3                        652
#define DC4B0                         653
#define DC4B                          654
#define DC4B1                         655
#define INLVLA                        656
#define INLVLA0                       657
#define INLVLA1                       658
#define INLVLA2                       659
#define INLVLA3                       660
#define INLVLA4                       661
#define INLVLA5                       662
#define INLVLB4                       663
#define INLVLB                        664
#define INLVLB5                       665
#define INLVLB6                       666
#define INLVLB7                       667
#define INLVLC                        668
#define INLVLC0                       669
#define INLVLC1                       670
#define INLVLC2                       671
#define INLVLC3                       672
#define INLVLC4                       673
#define INLVLC5                       674
#define INLVLC6                       675
#define INLVLC7                       676
#define IOCAP                         677
#define IOCAP0                        678
#define IOCAP1                        679
#define IOCAP2                        680
#define IOCAP3                        681
#define IOCAP4                        682
#define IOCAP5                        683
#define IOCAN0                        684
#define IOCAN                         685
#define IOCAN1                        686
#define IOCAN2                        687
#define IOCAN3                        688
#define IOCAN4                        689
#define IOCAN5                        690
#define IOCAF0                        691
#define IOCAF                         692
#define IOCAF1                        693
#define IOCAF2                        694
#define IOCAF3                        695
#define IOCAF4                        696
#define IOCAF5                        697
#define IOCBP                         698
#define IOCBP4                        699
#define IOCBP5                        700
#define IOCBP6                        701
#define IOCBP7                        702
#define IOCBN4                        703
#define IOCBN                         704
#define IOCBN5                        705
#define IOCBN6                        706
#define IOCBN7                        707
#define IOCBF4                        708
#define IOCBF                         709
#define IOCBF5                        710
#define IOCBF6                        711
#define IOCBF7                        712
#define CLKRCON                       713
#define CLKRDIV                       714
#define CLKRDIV0                      715
#define CLKRDIV1                      716
#define CLKRDIV2                      717
#define CLKRDC                        718
#define CLKRDC0                       719
#define CLKRDC1                       720
#define CLKRSLR                       721
#define CLKROE                        722
#define CLKREN                        723
#define MDCON                         724
#define MDBIT                         725
#define MDOUT                         726
#define MDOPOL                        727
#define MDSLR                         728
#define MDOE                          729
#define MDEN                          730
#define MDSRC                         731
#define MDMS0                         732
#define MDMS                          733
#define MDMS1                         734
#define MDMS2                         735
#define MDMS3                         736
#define MDMSODIS                      737
#define MDCARL                        738
#define MDCL0                         739
#define MDCL                          740
#define MDCL1                         741
#define MDCL2                         742
#define MDCL3                         743
#define MDCLSYNC                      744
#define MDCLPOL                       745
#define MDCLODIS                      746
#define MDCARH                        747
#define MDCH                          748
#define MDCH0                         749
#define MDCH1                         750
#define MDCH2                         751
#define MDCH3                         752
#define MDCHSYNC                      753
#define MDCHPOL                       754
#define MDCHODIS                      755
#define TMR4                          756
#define PR4                           757
#define T4CON                         758
#define T4CKPS0                       759
#define T4CKPS                        760
#define T4CKPS1                       761
#define TMR4ON                        762
#define T4OUTPS                       763
#define T4OUTPS0                      764
#define T4OUTPS1                      765
#define T4OUTPS2                      766
#define T4OUTPS3                      767
#define TMR6                          768
#define PR6                           769
#define T6CON                         770
#define T6CKPS0                       771
#define T6CKPS                        772
#define T6CKPS1                       773
#define TMR6ON                        774
#define T6OUTPS0                      775
#define T6OUTPS                       776
#define T6OUTPS1                      777
#define T6OUTPS2                      778
#define T6OUTPS3                      779
#define STATUS_SHAD                   780
#define C_SHAD                        781
#define DC_SHAD                       782
#define Z_SHAD                        783
#define WREG_SHAD                     784
#define BSR_SHAD                      785
#define PCLATH_SHAD                   786
#define FSR0L_SHAD                    787
#define FSR0H_SHAD                    788
#define FSR1L_SHAD                    789
#define FSR1H_SHAD                    790
#define STKPTR                        791
#define TOSL                          792
#define TOSH                          793

#endif // _PIC16F1829LIN_H_
